{
  "_name_or_path": "microsoft/deberta-v3-base",
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON_NAME",
    "2": "I-PERSON_NAME",
    "3": "B-COMPANY",
    "4": "I-COMPANY",
    "5": "B-CLIENT",
    "6": "I-CLIENT",
    "7": "B-ROLE",
    "8": "I-ROLE",
    "9": "B-LOCATION",
    "10": "I-LOCATION",
    "11": "B-DATE_START",
    "12": "I-DATE_START",
    "13": "B-DATE_END",
    "14": "I-DATE_END",
    "15": "B-DEGREE",
    "16": "I-DEGREE",
    "17": "B-FIELD",
    "18": "I-FIELD",
    "19": "B-FEILD",
    "20": "I-FEILD",
    "21": "B-INSTITUTION",
    "22": "I-INSTITUTION",
    "23": "B-EDU_YEAR_START",
    "24": "I-EDU_YEAR_START",
    "25": "B-EDU_YEAR_END",
    "26": "I-EDU_YEAR_END",
    "27": "B-GRADE",
    "28": "I-GRADE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CLIENT": 5,
    "B-COMPANY": 3,
    "B-DATE_END": 13,
    "B-DATE_START": 11,
    "B-DEGREE": 15,
    "B-EDU_YEAR_END": 25,
    "B-EDU_YEAR_START": 23,
    "B-FEILD": 19,
    "B-FIELD": 17,
    "B-GRADE": 27,
    "B-INSTITUTION": 21,
    "B-LOCATION": 9,
    "B-PERSON_NAME": 1,
    "B-ROLE": 7,
    "I-CLIENT": 6,
    "I-COMPANY": 4,
    "I-DATE_END": 14,
    "I-DATE_START": 12,
    "I-DEGREE": 16,
    "I-EDU_YEAR_END": 26,
    "I-EDU_YEAR_START": 24,
    "I-FEILD": 20,
    "I-FIELD": 18,
    "I-GRADE": 28,
    "I-INSTITUTION": 22,
    "I-LOCATION": 10,
    "I-PERSON_NAME": 2,
    "I-ROLE": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.44.0",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
